//第16讲--字符函数和字符串函数

/*顾名思义,就对字符和字符串进行操作的函数*/

// //先自己写小写字母转大写字母
// #include <stdio.h>

// int main()
// {
//     char arr[] = "I Am A Student";

//     int s = 0;
//     // char* s = arr;
    
//     while (arr[s] != "\0")
//     {
//         if(arr[s] >= 'a'&& arr[s]<= 'z')
//         {
//             arr[s] -= 32;
//         }
//         s++;
//     }
//     // while(*s != '\0')
//     // {
//     //     if(*s >= 'a'&& *s<= 'z')
//     //     {
//     //         *s -= 32;
//     //     }
//     //     s++;
//     // }

//     printf("%s",arr);

//     return 0;
// }


// //字符分类函数总概
// #include <ctype.h>
// //要接收返回值
//             //如果参数符合以下条件则返回真
// iscntrl();//任何控制字符
// isspace();//空格字符: 空格'',换页'\f',换行'\n',
// isdigit();//十进制数字'0'~'9'字符
// isxdigit();//十六进制数字,包括所有十进制数字字符,小写字母a~f,大写字母A~F
// islower();//小写字母a~z
// isupper();//大写字母A~Z
// isalpha();//字母a~z或a~z
// isalnum();//字母或数字,a~z,A~Z,0~9
// ispunct();//标点符号,任何不属于数字或者字母的图形字符(可打印)
// isgraph();//任何图形字符
// isprint();//任何可打印字符,包括图形字符和空白字符



















